Revit 2027 API
BRepBuilder.AllowRemovalOfProblematicFaces Method
 Allow BRepBuilder to remove problematic faces (e.g., due to inaccurate edge geometry). If this option is enabled and BRepBuilder removes some faces, the output geometry's type will be OpenShell regardless of the expected type specified when the BRepBuilder was created.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AllowRemovalOfProblematicFaces()
Public Sub AllowRemovalOfProblematicFaces
public:
void AllowRemovalOfProblematicFaces()
member AllowRemovalOfProblematicFaces : unit -> unit
See Also
Reference
BRepBuilder Class
Autodesk.Revit.DB Namespace